First/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьПоВозрастанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

First/src/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	РасчетСтрокиПоляСуммы();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	РасчетСтрокиПоляСуммы();
		
КонецПроцедуры


&НаКлиенте
Процедура РасчетСтрокиПоляСуммы()
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		 Возврат;
	Иначе ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоСумме(Команда)
	
	Если Объект.СортироватьПоВозрастанию = Ложь Тогда
		 Объект.Товары.Сортировать("Сумма Убыв");
		 Объект.СортироватьПоВозрастанию = Истина;
		 
		 	КартинкаСортировки = БиблиотекаКартинок.ОформлениеСтрелкаВверхЗеленая;
		 	Элементы.ТоварыСортироватьПоСумме.Картинка = КартинкаСортировки;
			
			УстановитьПодсказкуСортироватьПоСуммеПоВозр("СортироватьПоСумме");
			Элементы.ТоварыСортироватьПоСумме.Заголовок = "Сортировать по возрастанию";
	 Иначе
		 Объект.Товары.Сортировать("Сумма Возр");
		 Объект.СортироватьПоВозрастанию = Ложь;
		 
		 	КартинкаСортировки = БиблиотекаКартинок.ОформлениеСтрелкаВнизКрасная;
		 	Элементы.ТоварыСортироватьПоСумме.Картинка = КартинкаСортировки;
			
			УстановитьПодсказкуСортироватьПоСуммеПоУбыв("СортироватьПоСумме");
			Элементы.ТоварыСортироватьПоСумме.Заголовок = "Сортировать по убыванию";
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкуСортироватьПоСуммеПоУбыв(ИмяКоманды)
	Команды.Найти(ИмяКоманды).Подсказка = "Сортировать по сумме по убыванию";
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкуСортироватьПоСуммеПоВозр(ИмяКоманды)
	Команды.Найти(ИмяКоманды).Подсказка = "Сортировать по сумме по возрастанию";
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.Цена = 0 Тогда
		 Возврат;
	 Иначе ЦелаяЧастьКоличества = Цел(ТекущиеДанные.Сумма / ТекущиеДанные.Цена);
		   ТекущиеДанные.Количество = ЦелаяЧастьКоличества;
		   НоваяСумма = ЦелаяЧастьКоличества * ТекущиеДанные.Цена;
		   ТекущиеДанные.Сумма = НоваяСумма;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораСписком", , Элементы.Товары);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыбранныеДанные Из ВыбранноеЗначение Цикл
		
		СтрокаТаблицы = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыбранныеДанные);
		
	КонецЦикла;
	
	ПослеПодбора();
	
КонецПроцедуры 


&НаСервере
Процедура ПослеПодбора() Экспорт

	Таблица = Новый ТаблицаЗначений;
    Таблица = Объект.Товары.Выгрузить();    
    Таблица.Свернуть("Номенклатура","Количество, Цена, Сумма");
	// Пересчитываем Сумму в строках перед выгрузкой в Табличную часть
	Для Каждого СтрокаТЗ Из Таблица Цикл
		СтрокаТЗ.Сумма = СтрокаТЗ.Количество * СтрокаТЗ.Цена;
	КонецЦикла;
	// Выгружаем
	Объект.Товары.Загрузить(Таблица);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Дата = Формат(ТекущаяДата(), "ДЛФ=DT");
    Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник; 
КонецПроцедуры
